In [1]:
#Serilerin yan yana gelmesiyle oluşan bir tablo gibi düşünülebilir

In [2]:
import numpy as np
import pandas as pd

In [9]:
data=np.random.randn(4,5)

In [10]:
data

array([[ 2.16828514e-01,  1.11643409e+00, -2.41961201e-01,
         1.74004893e+00,  2.03418833e-03],
       [ 1.91857478e+00, -2.24225854e-02,  1.50473104e+00,
        -4.02798489e-01,  4.29149616e-01],
       [-1.62711305e+00, -2.59733779e-01, -9.99341905e-01,
        -5.41397537e-01, -1.10760358e+00],
       [ 2.17116302e+00,  1.13094555e+00,  1.57231077e+00,
         5.59314634e-01, -9.31527428e-01]])

In [11]:
dataFrame=pd.DataFrame(data)

In [12]:
dataFrame

          0         1         2         3         4
0  0.216829  1.116434 -0.241961  1.740049  0.002034
1  1.918575 -0.022423  1.504731 -0.402798  0.429150
2 -1.627113 -0.259734 -0.999342 -0.541398 -1.107604
3  2.171163  1.130946  1.572311  0.559315 -0.931527

In [13]:
# Mesela dataFrame[0] dersek bize 0. kolonu getirir.

In [14]:
yeniDataFrame=pd.DataFrame(data,index=["Ali","Ahmet","Ayşe","Fatma"],columns=["Vize","Final","Quiz1","Quiz2","Ortalama"])

In [15]:
yeniDataFrame

           Vize     Final     Quiz1     Quiz2  Ortalama
Ali    0.216829  1.116434 -0.241961  1.740049  0.002034
Ahmet  1.918575 -0.022423  1.504731 -0.402798  0.429150
Ayşe  -1.627113 -0.259734 -0.999342 -0.541398 -1.107604
Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527

In [16]:
yeniDataFrame["Vize"]

Ali      0.216829
Ahmet    1.918575
Ayşe    -1.627113
Fatma    2.171163
Name: Vize, dtype: float64

In [17]:
yeniDataFrame["Quiz2"]

Ali      1.740049
Ahmet   -0.402798
Ayşe    -0.541398
Fatma    0.559315
Name: Quiz2, dtype: float64

In [18]:
yeniDataFrame[["Quiz1","Quiz2","Ortalama"]]

          Quiz1     Quiz2  Ortalama
Ali   -0.241961  1.740049  0.002034
Ahmet  1.504731 -0.402798  0.429150
Ayşe  -0.999342 -0.541398 -1.107604
Fatma  1.572311  0.559315 -0.931527

In [19]:
#Row seçmek istersek "loc(locate)" kullanmamız gerekli.
#"iloc" ile de indekse göre çağırabiliriz.

yeniDataFrame.loc["Ali"]

Vize        0.216829
Final       1.116434
Quiz1      -0.241961
Quiz2       1.740049
Ortalama    0.002034
Name: Ali, dtype: float64

In [21]:
yeniDataFrame.loc["Ali"]

Vize        0.216829
Final       1.116434
Quiz1      -0.241961
Quiz2       1.740049
Ortalama    0.002034
Name: Ali, dtype: float64

In [22]:
yeniDataFrame.iloc[0]

Vize        0.216829
Final       1.116434
Quiz1      -0.241961
Quiz2       1.740049
Ortalama    0.002034
Name: Ali, dtype: float64

In [23]:
# DataFrame'e kolon eklemek ve silmek!

yeniDataFrame["artıPuan"]=yeniDataFrame["Quiz1"]+yeniDataFrame["Quiz1"]

In [24]:
yeniDataFrame

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Ali    0.216829  1.116434 -0.241961  1.740049  0.002034 -0.483922
Ahmet  1.918575 -0.022423  1.504731 -0.402798  0.429150  3.009462
Ayşe  -1.627113 -0.259734 -0.999342 -0.541398 -1.107604 -1.998684
Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527  3.144622

In [26]:
#axis=1 burada kolonu temsil eder.axis=0 ise satırı.
yeniDataFrame.drop("artıPuan",axis=1)

           Vize     Final     Quiz1     Quiz2  Ortalama
Ali    0.216829  1.116434 -0.241961  1.740049  0.002034
Ahmet  1.918575 -0.022423  1.504731 -0.402798  0.429150
Ayşe  -1.627113 -0.259734 -0.999342 -0.541398 -1.107604
Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527

In [27]:
yeniDataFrame.drop("Ali",axis=0)

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Ahmet  1.918575 -0.022423  1.504731 -0.402798  0.429150  3.009462
Ayşe  -1.627113 -0.259734 -0.999342 -0.541398 -1.107604 -1.998684
Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527  3.144622

In [23]:
yeniDataFrame

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Ali   -1.018766 -0.448982 -0.291755 -0.315464  1.408549 -0.583509
Ahmet -0.588107 -0.163892 -1.201523 -0.272635 -2.419466 -2.403046
Ayşe   1.587335 -0.088957 -1.321133  1.905587 -0.266351 -2.642265
Fatma  0.950170  0.610520 -0.360557  1.669627 -0.792961 -0.721114

In [28]:
#Burada kalıcı silinmedi bunun için "inplace(yerinde anlamına gelir)" kullanılmalı

yeniDataFrame.drop("Ali",axis=0,inplace=True)

In [29]:
yeniDataFrame

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Ahmet  1.918575 -0.022423  1.504731 -0.402798  0.429150  3.009462
Ayşe  -1.627113 -0.259734 -0.999342 -0.541398 -1.107604 -1.998684
Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527  3.144622

In [30]:
yeniDataFrame.loc["Ahmet"]["Quiz1"]

1.5047310367890638

In [31]:
yeniDataFrame.loc["Ahmet","Quiz1"]

1.5047310367890638

In [34]:
deger=yeniDataFrame>0

In [35]:
deger

        Vize  Final  Quiz1  Quiz2  Ortalama  artıPuan
Ahmet   True  False   True  False      True      True
Ayşe   False  False  False  False     False     False
Fatma   True   True   True   True     False      True

In [36]:
yeniDataFrame[deger]

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Ahmet  1.918575       NaN  1.504731       NaN   0.42915  3.009462
Ayşe        NaN       NaN       NaN       NaN       NaN       NaN
Fatma  2.171163  1.130946  1.572311  0.559315       NaN  3.144622

In [37]:
yeniDataFrame[yeniDataFrame>0]

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Ahmet  1.918575       NaN  1.504731       NaN   0.42915  3.009462
Ayşe        NaN       NaN       NaN       NaN       NaN       NaN
Fatma  2.171163  1.130946  1.572311  0.559315       NaN  3.144622

In [38]:
#Kolonlarda Filtreleme yapılabilir.

deger2=yeniDataFrame["Final"]>0

In [39]:
#Sadece şartı sağlayan değer geldi.
yeniDataFrame[deger2]

           Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527  3.144622

In [40]:
#indeksi sıfırlamak istersek "reset_index() kullanırız ama kalıcı olması için inplace kullanılmalı"

In [44]:
yeniDataFrame.reset_index(inplace=True)

In [45]:
yeniDataFrame

   index      Vize     Final     Quiz1     Quiz2  Ortalama  artıPuan
0  Ahmet  1.918575 -0.022423  1.504731 -0.402798  0.429150  3.009462
1   Ayşe -1.627113 -0.259734 -0.999342 -0.541398 -1.107604 -1.998684
2  Fatma  2.171163  1.130946  1.572311  0.559315 -0.931527  3.144622

## İndeks Değiştirme

In [46]:
adlarListesi=["Ahmt","Ayş","Ftm"]

In [47]:
yeniDataFrame["AdlarKısaltması"]=adlarListesi

In [48]:
yeniDataFrame

,index,Vize,Final,Quiz1,Quiz2,Ortalama,artıPuan,AdlarKısaltması
0,Ahmet,1.918575,-0.022423,1.504731,-0.402798,0.429150,3.009462,Ahmt
1,Ayşe,-1.627113,-0.259734,-0.999342,-0.541398,-1.107604,-1.998684,Ayş
2,Fatma,2.171163,1.130946,1.572311,0.559315,-0.931527,3.144622,Ftm

In [51]:
yeniDataFrame.set_index("AdlarKısaltması",inplace=True)

In [52]:
yeniDataFrame

,index,Vize,Final,Quiz1,Quiz2,Ortalama,artıPuan
AdlarKısaltması,,,,,,,
Ahmt,Ahmet,1.918575,-0.022423,1.504731,-0.402798,0.429150,3.009462
Ayş,Ayşe,-1.627113,-0.259734,-0.999342,-0.541398,-1.107604,-1.998684
Ftm,Fatma,2.171163,1.130946,1.572311,0.559315,-0.931527,3.144622

In [54]:
yeniDataFrame

,index,Vize,Final,Quiz1,Quiz2,Ortalama,artıPuan
AdlarKısaltması,,,,,,,
Ahmt,Ahmet,1.918575,-0.022423,1.504731,-0.402798,0.429150,3.009462
Ayş,Ayşe,-1.627113,-0.259734,-0.999342,-0.541398,-1.107604,-1.998684
Ftm,Fatma,2.171163,1.130946,1.572311,0.559315,-0.931527,3.144622

## Multi İndeks

In [55]:
ilkIndeksler=["Kuş","Kuş","Kuş","Sürüngen","Sürüngen"]
icindekiler=["Bülbül","Kartal","Papağan","Yılan","Kertenkele"]

In [56]:
birlesmisListe=list(zip(ilkIndeksler,icindekiler))

In [57]:
birlesmisListe

[('Kuş', 'Bülbül'),
 ('Kuş', 'Kartal'),
 ('Kuş', 'Papağan'),
 ('Sürüngen', 'Yılan'),
 ('Sürüngen', 'Kertenkele')]

In [58]:
sonBirlesme=pd.MultiIndex.from_tuples(birlesmisListe)

In [59]:
sonBirlesme

MultiIndex([(     'Kuş',     'Bülbül'),
            (     'Kuş',     'Kartal'),
            (     'Kuş',    'Papağan'),
            ('Sürüngen',      'Yılan'),
            ('Sürüngen', 'Kertenkele')],
           )

In [60]:
data=[[40,"A"],[50,"B"],[60,"C"],[70,"D"],[80,"E"]]

In [61]:
numpyarray=np.array(data)
dataFrameSonBirlesme=pd.DataFrame(numpyarray,index=sonBirlesme,columns=["Puan","Sınıf"])

In [62]:
dataFrameSonBirlesme

                    Puan Sınıf
Kuş      Bülbül       40     A
         Kartal       50     B
         Papağan      60     C
Sürüngen Yılan        70     D
         Kertenkele   80     E

In [63]:
dataFrameSonBirlesme.loc["Kuş"].loc["Bülbül"]

Puan     40
Sınıf     A
Name: Bülbül, dtype: object

In [64]:
dataFrameSonBirlesme.index.names=["Cins","Adı"]

In [65]:
dataFrameSonBirlesme

                    Puan Sınıf
Cins     Adı
Kuş      Bülbül       40     A
         Kartal       50     B
         Papağan      60     C
Sürüngen Yılan        70     D
         Kertenkele   80     E